{"user_id": "mh_-eMZ6K5RLWhZyISBhwA", "business_id": "XQfwVwDr-v0ZS3_CbbE5Xw", "stars": 3.0, "text": "If you decide to eat here, just be aware it is going to take about 2 hours from beginning to end. We have tried it multiple times, because I want to like it! I have been to it's other locations in NJ and never had a bad experience. \n\nThe food is good, but it takes a very long time to come out. The waitstaff is very young, but usually pleasant. We have just had too many experiences where we spent way too long waiting. We usually opt for another diner or restaurant on the weekends, in order to be done quicker."}
{"user_id": "OyoGAe7OKpv6SyGZT5g77Q", "business_id": "7ATYjTIgM3jUlt4UM3IypQ", "stars": 5.0, "text": "I've taken a lot of spin classes over the years, and nothing compares to the classes at Body Cycle. From the nice, clean space and amazing bikes, to the welcoming and motivating instructors, every class is a top notch work out.\n\nFor anyone who struggles to fit workouts in, the online scheduling system makes it easy to plan ahead (and there's no need to line up way in advanced like many gyms make you do).\n\nThere is no way I can write this review without giving Russell, the owner of Body Cycle, a shout out. Russell's passion for fitness and cycling is so evident, as is his desire for all of his clients to succeed. He is always dropping in to classes to check in/provide encouragement, and is open to ideas and recommendations from anyone. Russell always wears a smile on his face, even when he's kicking your butt in class!"}
{"user_id": "smOvOajNG0lS4Pq7d8g4JQ", "business_id": "RZtGWDLCAtuipwaZ-UfjmQ", "stars": 4.0, "text": "Good food--loved the gnocchi with marinara\nthe baked eggplant appetizer was very good too\n\nThe service was very slow, but despite this, I'd go back, the food is just that good"}
{"user_id": "IQsF3Rc6IgCzjVV9DE8KXg", "business_id": "eFvzHawVJofxSnD7TgbZtg", "stars": 5.0, "text": "My absolute favorite cafe in the city. Their black and white latte is probably the best I've ever had (not too sweet and just the right amount of foam), soups are always really good (even for non-soup people) and there's just a lot of space to do work. The noise level is perfect, the music is at a perfect level, and I always enjoy when patrons bring their dogs. I'll keep giving them my business for as long as I can."}
{"user_id": "vrKkXsozqqecF3CW4cGaVQ", "business_id": "rjuWz_AD3WfXJc03AhIO_w", "stars": 5.0, "text": "I thoroughly enjoyed the show.  Chill way to spend a Friday night."}
{"user_id": "clWLI5OZP2ad25ugMVI8gg", "business_id": "x4XdNhp0Xn8lOivzc77J-g", "stars": 5.0, "text": "Best thai food in the area.  Everything was authentic and delicious.  Will definitely be back again and again."}
{"user_id": "Jha0USGDMefGFRLik_xFQg", "business_id": "bMratNjTG5ZFEA6hVyr-xQ", "stars": 5.0, "text": "First time there and it was excellent!!! It feels like your are entering someone's home. The waiters there funny and nice. The food come out very quickly and it is phenomenal!!! Definitely will be going back to this place."}
{"user_id": "QzCEzH3R7Z6erOGLr3t55Q", "business_id": "0pMj5xUAecW9o1P35B0AMw", "stars": 5.0, "text": "Great staff always helps and always nice. Always clean and huge store size. Stays stocked with everything you need. The staff always helps make my custom breakfast bagel"}
{"user_id": "aFa96pz67TwOFu4Weq5Agg", "business_id": "kq5Ghhh14r-eCxlVmlyd8w", "stars": 5.0, "text": "My boyfriend and I tried this deli for the first time today. I had a turkey, avocado & bacon panini and he ha a buffalo chicken wrap. We will definitely be returning. The wait for food wasn't too long, which is always appreciated during lunch hour. There was SO much to choose from. They have salads, soup, macaroni, sandwiches and hot food. I love a deli that has many options to choose from!"}
{"user_id": "yobeeTUBfaTBcnk26mXNuA", "business_id": "hKameFsaXh9g8WQbv593UA", "stars": 4.0, "text": "Food was good- atmosphere/decor is like a fishing lodge- menu is someplace between outback & bonefish. Went on a Groupon & all 3 of our meals & calamari appetizer that we ordered were cooked perfectly- we will def be back."}
{"user_id": "l_izt6hn7oTxalU06mSyqg", "business_id": "jTI5Xjk27An8ceJ6VwpXiQ", "stars": 4.0, "text": "Comfortable bed, good breakfast, fast internet, great location, and low price. Overall I was really impressed with this place. However, if you stay on the top floors you may be waiting up to 15 minutes for an elevator in the morning."}
{"user_id": "Z2cOL3n9V8NoguJ-uU_Nvw", "business_id": "j8JOZvfeHEfUWq3gEz6ABQ", "stars": 2.0, "text": "NEVER AGAIN. This is a so called restaurant that does nothing that a restaurant should other than prepare food, because the rest is done by the patron. Want water? Get up and go across the yard to get it. Want a drink, walk up a flight of stairs and pay cash. Want to sit in a dirty yard in dirty lawn chairs, enjoy yourself. The wait staff is mildy helpful in that they bring you your food after you go to the window and pay cash for it...kind of like New Orleans Hamburger and Seafood, but dirty and with live music (which is nice). It's a one in a lifetime experience for me...just once."}
{"user_id": "IKbjLnfBQtEyVzEu8CuOLg", "business_id": "VJEzpfLs_Jnzgqh5A_FVTg", "stars": 4.0, "text": "It was my fiance's birthday and he decided he wanted a good, laid back Thai restaurant for dinner. Yelp steered us in the Jasmine Rice direction, and it was definitely a good decision. We wanted the summer rolls, which were on the menu, but apparently will not be available until summer, so we settled on the pan-fried dumplings. The flavor was good, but I don't think we'd order them again. We got the green curry fried rice with duck and chicken pad thai. Both of those dishes were great, but the duck stole the show. That was some the of tastiest duck I've ever had. The pad thai was a bit sweet for us, so I think we'd try a different noodle dish when we return. But it was still very good, especially with some chili sauce mixed in. Our service was good, but other people had issues. One table was rushing to get to a show at the Kimmel Center and waited quite a while for their meal (and were going to be late). Another person who got take-out was missing one of their items (but the owner realized it and called him and walked the dish to his house, which was very nice). Overall, good quality Thai! We would definitely go back."}
{"user_id": "9ZLpaBGl-udvS-niR3Y_ow", "business_id": "GILL0ZkvVXJaNQzYRXfMQw", "stars": 5.0, "text": "I absolutely love Courtney! She is hands down the best hairstylist I have ever had. The reason I think she is so great is that she knows what will look best on me and over the past year has understood my limits for styles. I always go into the salon and tell her to cut my hair how she thinks will look best, and I always leave blown away at what she does. You know you have a great stylist when you don't have to specify what you want done, but instead they see what needs to be done. Great stylist, great personality and very knowledgeable. I would highly recommend her to anyone who wants to look their best."}
{"user_id": "NUtIAX-ygn474tDg5nmesg", "business_id": "6LCZLGa09Qifn6rG7-DNrg", "stars": 4.0, "text": "My go to menu is coconut soup and pad thai with protein. I tried same menu here. \nActually really like their coconut soup. They used enough amount of coconut milk that soup was really creamy and wasn't over powering with herb. I am so used to Americanized thai cuisine that I prefer less herb on my dish except cilantro.\nPat thai was great too. Liked the amount of peanut they used, noodle was chewy and perfect and not too sweet. They gave me generous amount of chicken and white meat wasn't dry so I was very happy with my meal."}
{"user_id": "aWlojpSpzEICTza3RgGJgg", "business_id": "SIoCIxjn4jLt2O-4DajWJw", "stars": 4.0, "text": "My go-to spot on a Saturday night! I was real bummed that lucys closed, but was pleasantly surprised by this bar just across the street!\nTheir food is better than expected. I always get wings and fries. (be careful of the wtf sauce though) Sometimes it takes a real long time to get the bartenders attention, but the place is usually packed. And if you're lucky the always sunny crew will pop in!"}
{"user_id": "uAu772KpSkb-tPFgZmU-lA", "business_id": "2GYg3liJ9-m6Z67L_4_BRQ", "stars": 5.0, "text": "I LOVE Weaver's Way and really disagree with some of the content in previous reviews. WW is not necessarily meant for convenience shopping. I am a single woman and I find that I have no trouble shopping at the co-op, during peak times or otherwise. I actually find the co-op to be a great place to shop if you live alone because I can get smaller quantities of items than if I shop at the corporate stores like Acme. I also enjoy the work hours - I've worked throughout the store, but most recently, I have been getting in my hours by participating in the membership committee. I wouldn't say that the community is necessarily made up of \"tree huggers\" and \"earth children\", though. The community is made up of a variety of similarly-minded folks from different backgrounds. I enjoy having a place to go to where I can obtain locally grown produce, a place that offers more natural, wholesome, and preservative-free foods than chain stores with prices way below that of Whole Foods. I enjoy interacting with other members and contributing to my local and global community. I don't find the membership fee or the work hours to be prohibitive being a single person vs. a family. I don't think that membership in a co-op is for everyone and, if you aren't single, it's definitely not a solo decision. If you're keen on being committed to the Weaver Way values, you couldn't find a better place to shop. If not, stick to the chain stores or just pay the 10% visitors' fee to pop in once in a while."}
{"user_id": "Z5j9Xw_G0c7M2b1-iS67wg", "business_id": "HTqXI5S2XcSlh_ylx9sE6g", "stars": 5.0, "text": "I've only had the cannolis here but they are awesome! They're freshly filled when ordered and the filling is phenomenal. Not too sweet, it's perfect. If you like cannoli, if you don't think you like cannoli, you should definitely get one from Termini Bros."}
{"user_id": "CgyCtH9CbLO7J_uO3cL7OA", "business_id": "PzhPMkaNYiKDTHoTG0r8rw", "stars": 4.0, "text": "After 3 weeks of working in the area I finally found a place off of Magazine that is not overrated. Friendly staff! Y'all know I love Phò so it's pretty damn good!"}
{"user_id": "07aVWNhBhpwqW3MdqoKDKQ", "business_id": "jLerIZFpe25jOUf722qzBA", "stars": 3.0, "text": "My food only merited maybe two stars but I will give an extra star because I like the menu (and will try more of it) and their design and concept.  Sadly though, my tomato-basil soup tasted kind of like a weak marinara and my tuna melt type sandwich had a very sharp, off-putting flavor.  It was citrusy, for sure, and I love lemon in a tuna melt but perhaps this was lemon zest or something just way too overpowering?  I think next time I will focus on the dishes with cured Italian meats, mortadella and prosciutto.  And also the baked goods, those sounded pretty good, especially the Nutella bruschetta!"}
{"user_id": "Zs8Zk3sgh5JxRmoZW4PJcg", "business_id": "3ZynJ94VpIdDlaArmEp2Rg", "stars": 3.0, "text": "A couple friends and I stopped by for some late night milkshakes and found ourselves at More Than Just Ice Cream. Well, we just got ice cream...not fully taking advantage of what the name implies, but maybe next time.\n\n3 milkshakes: 1 coffee, 1 chocolate, and 1 black&white malt. \n\nAll were pretty good. Definitely satisfied the ice cream craving. I thought my coffee milkshake could have been thicker, same goes for the chocolate. The black&white was plenty thick and was probably the best of the three. Unfortunately, I did not order that one so I settled for my not so creamy coffee.\n\nI did sample some ice cream flavors before setting on a milkshake. I tried the pumpkin pie which was AMAZING. I don't know why I didn't just get this. Maybe a milkshake isn't the way to go here."}
{"user_id": "Pbry-b9xBgHlWlbGlYbTZg", "business_id": "b7V_5q22_eTeHlYzq1bpFw", "stars": 3.0, "text": "I visited this restaurant 4 times during my 5 days stay. Crazy, right? Here are a list of reasons/pros:\n\n- We were staying a nearby hotel.\n- The restaurant opens 11 - 10:30 pretty much every day including new year's day so it fits into our schedule.\n- If you are a party of two, chances are you get seated right away.\n- $9 per dozen of oysters which is a really great deal by any standard!\n- They have a seafood shop next door that sells boiled and fresh seafood to- go.\n- Our server (same) is very friendly and recognized us every single time.\n\nNow I want to talk about the reasons why I only give it 3 stars.\n\n- We tried a bunch of stuff which are all pretty mediocre. Raw oysters are not cleaned well. So if your schedule is flexible, go to Superior Seafood during their happy hours for their 50 cents/oyster - better quality and cheaper. Turtle soup has a strange taste so I definitely prefer Felix's. A portion of my boiled shrimps are always mushy somhow, maybe boiled for too long?...\n- The ambient is inviting but not comfortable so we basically just finished our food and go. \n- Clean the bathroom!!\n\nWill probably visit again if we stay in the area next time or simply just pick up some seafood quickly."}
{"user_id": "kHmXUEOAsIbguUrPoX6Tkg", "business_id": "iD25g7vUG3asELjXtMGF9w", "stars": 2.0, "text": "Meh is all I can say for TDS. The restaurant itself is just cold.... not literally, but figuratively. There was no decor, no menu boards, stainless steel prep tables as dining tables, no soda machines, staff EVERYWHERE with no identification (shirts, nametags, etc). The food is reasonably priced and most of it was quite good, but what really irked my party was the fact that they charge for extra salsa!!! We ordered a salsa trio (which included 3 samples of the various salsas, in 2oz glass prep bowls), and when my brother asked for more salsa for his tacos (mind you, we ordered one of ever taco, three burritos and guacamole), he was told he'd have to buy the trio again! Really!!??? We spent over $40 on food, drinks and apps, too. Even though the food was decent, I wouldn't return as the atmosphere is just blah and you can't get extra salsa for your damn tacos!"}
{"user_id": "zKAHSNzqvwsyoFCw3QpafA", "business_id": "S2Ho8yLxhKAa26pBAm6rxA", "stars": 4.0, "text": "Enjoyed my fish out at a sidewalk table.  A bit pricey but food was good.  Go to Side street in French quarter if u want quieter dining outside."}
{"user_id": "3TL6HZ1JrKcNTvGDWKlrow", "business_id": "GyC36Pn0Q1-qHnqXys6yFg", "stars": 1.0, "text": "Service and management terrible... After messing up all 4 of our orders the waiter got mad and started cursing... The manager offered our drinks to be free.. What a mess. The food was cold and nasty didn't even eat half of it and waited over an hour... I will never dine in any cracker barrel again after this experience..."}
{"user_id": "EfG0nInFMbiO9Hy7A6B2cQ", "business_id": "fGYnHzFr1z2kv7bPRW6VMA", "stars": 3.0, "text": "Sometimes this food is very very good.  Unfortunately it's not consistent.   Ordered something I've been getting for years and every other time it tastes incredible. It's like they have different people in the kitchen and you don't know who you will get. So 50 % of the time it's excellent.  UGH."}
{"user_id": "OkjeFppodgJP_CvB84cJYw", "business_id": "FHNIvNgh3fS7VZQq2Y3dsA", "stars": 3.0, "text": "After trying a few ramen places with crazy variety in their selections and stellar broth, I was not too excited about the ramen I got at Cheu.  Maybe it's a matter of taste, but personally, I was not a fan of their thick noodles, and extremely salty broth.  \n\nThe service was great, and they had a nice selection of beers!  The friend I went with loved it, and has been many times.  Honestly, I'm just sorry I wasn't a bigger fan.  But I hope others try it for themselves.  I might just be an oddball out on this one."}
{"user_id": "Zp1o52IRl92dunmsfiT96g", "business_id": "gGyqnAlpFrka_qzpO7j4lQ", "stars": 5.0, "text": "Federal Doughnuts is a new concession at the ballpark -- who doesn't love some doughnuts and fried chicken?  \n\nAlso, there is now a concession stand near 136 that is gluten-free dedicated.  They offer pizza, cheesesteaks and even brownies and cookies."}
{"user_id": "Cvi8nZTwDVaQkqmmgQwQMw", "business_id": "D4DZztR7vkbiED6txGUYFg", "stars": 4.0, "text": "Looks like there is a second Red Kings restaurant in Chinatown and it did not disappoint! Since this place just opened yesterday, I'm not exactly sure if it's replacing the other Red Kings down the street, or if it is just a second helping of spicy, Szechuan food.\n\nWe ordered takeout and picked up the Dan Dan Noodles and a shredded Pork in Garlic sauce dish. The spice level in both dishes was perfect.  Extremely mouth-burning, but with delicious flavors that were sweet, earthy, and fresh. The portions were very generous and will make for great leftovers for us. I can't wait to try some of the other dishes and come back here for a sit-down dinner. They also have karaoke rooms upstairs, plus they are BYOB."}
{"user_id": "FEI0XkOrUHufSW_rfOTPAA", "business_id": "Dv6RfXLYe1atjgz3Xf4GGw", "stars": 4.0, "text": "Good food, reasonably priced, and nice staff. Not ideal for eating in, but since they are going for a fast food approach to vegan food, that makes a lot of sense. I know the buffalo bella is the dish that they push the hardest, but for my money the Cheesesteak is the way to go. And pro-tip: Get the sweet potato fries."}
{"user_id": "0Igx-a1wAstiBDerGxXk2A", "business_id": "actDmpJyaQPnkds6knMdKA", "stars": 5.0, "text": "Say you decide that you need a new door...and you only have $35.  Where do you go?  the Green Project. \n\nOr you have a bunch of left over building supplies, random bits of lumber, some roofing materials, maybe even some paint?  Where can you bring it so it doesn't end up in a landfill?  Again, the Green Project."}
{"user_id": "7RU_xK1tEGlUvXfe0GvtEg", "business_id": "hAmuto6UndVroyd_DaD-TA", "stars": 5.0, "text": "Not sure why it took until now for us to find this place. We started out going to the chain lobster restaurant but wanted something more authentic. A friend recommended Lobster Haven and I checked it out online. Looked like a type of place we would eat at in Massachusetts when we visit family. We were not disappointed! Service was great, fast and very friendly. Huge selection of all of the favorites. You have to visit this place if you want authentic New England seafood. You can also purchase live lobster and fresh seafood to go and cook it yourself."}
{"user_id": "16_EZvrDyxjDgxq6OUdbhQ", "business_id": "WaRZsQEcEHwRk0T2dJ-cuA", "stars": 5.0, "text": "Fabulous! Best happy hour, fresh menu, Delish- drinks, if I had the time, I'd come here every day!"}
{"user_id": "x-LrGPXN7WFX15Qk9B6_YQ", "business_id": "eMiN8nm70jjKg8izikVWDA", "stars": 4.0, "text": "Oh Chickie's and Pete's, you are the perfect place to watch some sports and indulge. \n\nNo doubt this is not the best food I've ever had but, if you can get a seat, grab some beer with mussels red and crab fries, there's no way not to thoroughly enjoy this place during a game or any time you're down by the stadiums. \n\nMy favs are the crab fries, mussels red (white is overloaded with garlic that I can't always take it), the spicy pull and peel shrimp, steamers, and if the mood is right the blue crabs (it's a lot of work but tasty). This place also makes getting down and dirty with your food easy. There are sinks all over so you can rinse the mess off your hands once you're done....good touch.\n\nTo sum it up, Chickie's and Pete's is a Philadelphia institution and always a good time. I strongly suggest going at least once to enjoy the experience. \n\nPlease note: Make sure to remember two things before coming during major sporting events. 1. You'll never get a table and 2. You'll deal with a ton of drunk people. I've absolutely been one of these people before and we can get annoying unless you're in the right frame of mind. :)"}
{"user_id": "KqKXOl0PMlZGBMlw8OUpyA", "business_id": "-If0ps0QhOLCYVWQWs9RYg", "stars": 5.0, "text": "Yes! I love this place! Maple Street Patisserie is the bomb.com! I've never been disappointed. Best blueberry muffin I've ever had in my whole entire life. Delicious breakfast and lunch spot. They also do specialty cakes so swing by during Mardi Gras and grab a king cake. Also the owner, Ziggy, is the man. He's always running around working crazy hours to make all these scrumptious baked goods. Can't beat this place :)"}
{"user_id": "o4tYl3Hz0oDfpNn4k02DCw", "business_id": "AzseSGgDC6bVtMPEYo1CNQ", "stars": 4.0, "text": "Came in after attending the Zurich Classic golf tournament. It was a warm and a bit humid so what tastier then a ice cream cone? I lucked out and found a parking space on the street. The interior is quite cute and comfy.\n\nThe selection here is crazy huge but after sampling a couple of unusual flavors I went with the scoop of cookie monster ice cream on a cone. The ice cream hit the spot and I enjoyed it BC it wasn't overly sweet.\n\nCreole Creamery was definitely worth checking out!"}
{"user_id": "Vn8iqqu3T8QkmOlyH82zDA", "business_id": "a1u9Bxrq_fZxl2pgqQUcJA", "stars": 4.0, "text": "It's was okay service was a bit on the interesting side as the person was new. Food presentation was good though they need to either add rice or more potato salad to the gumbo. Sprite was flat but I didn't need it anyways."}
{"user_id": "kSMOJwJXuEUqzfmuFncK4A", "business_id": "kxX2SOes4o-D3ZQBkiMRfA", "stars": 2.0, "text": "Dine-in gets 2 stars. Disappointing service & venue falls short. \n\nThe food was ok; so if you were to do take out, maybe this place would get 3 stars. \n\nI ordered the lamb kebab, which tasted ok; but it was very plain. No sauces, lettuce or anything - just meat."}
{"user_id": "EwoCJoV29tB-yAWJnZqJZA", "business_id": "G-zzByEfv2oqjcxYmPsjtA", "stars": 5.0, "text": "Truly, I cannot say enough good things about this tiny, authentic, perfectly delicious eatery!  Growing up in the panhandle of Texas, we had plenty of authentic Mexican food in our home, and I'm always searching for good Mexican restaurants. El Limon is the best I've ever had in the state of Pennsylvania!  Sopes, tostadas, enchiladas, fajitas, burritos, fish tacos....all excellent and sooooo reasonable!  Waitstaff is always pleasant and attentive.  Best two features: homemade tamales and free margaritas!!  Bring the entire family for an amazing Mexican feast!  Ole!"}
{"user_id": "88Z1DbloWrT7g8GA5qOrng", "business_id": "CmjvsiafnWH60fuYz2LCmA", "stars": 5.0, "text": "Recently had my car tinted by Orange Tint and Tune and had fantastic service.  They offer a car pick up service if you live within 4 miles of their shop which is extremely convenient.  Carlos was my technician and went over all the tint options with me and even adjusted the grade of the tint after I expressed the look that I was trying to achieve.  That's the kind of customer care that deserves 5 stars.  In addition, the receptionist was very pleasant and the owner Dustin even followed up to see how my service was."}
{"user_id": "jcJGCNrEgPHsl7zkvumq2Q", "business_id": "QUEWdnmVCv2Ri8xJATTrIQ", "stars": 4.0, "text": "Came here after my husband bought home their lemon pepper wings. They have plenty of flavors. Ranging from ones you've heard of (lemon pepper, mild) to New Orleans flavors (yaka mein, noonie bird). They also have their drinks. The watermelon is to die for. I don't know what they put in it but lord help them. The location isn't the best but they're trying to put something back in the community. It's in the same section with the daiquiri shop so it's really not that bad during the day. I probably wouldn't come at night by myself. Definitely give this place a try. Hey you might even see Skip."}
{"user_id": "xXYNgEWnjaim2byFGLex-w", "business_id": "7WZ5EGb-Xk_uxQTWc52P4w", "stars": 5.0, "text": "Back to Tom Jones and time to update my review. I didn't see that odd ATM type machine that only lets you withdraw money to apply to your check. It's no longer there-used to be next to restrooms. There is still a payphone back there which I love. There are now ATM's at front entrance.\n  The blue ribbon is now $3.79, but still a bargain since it includes everything: pancakes, 2 eggs, toast, sausage, bacon,juice & coffee. I ate here with my kids. My daughter's choice. Says she \"loves Tom Jones\". Our meals included blue ribbons, french toast, chicken, club sandwich & baked potato . Everyone gets what they like. \n   I don't smell stale smoke and would not call it dirty.  I like the \"loud\" orange booths. I feel like I went back in time with these and the payphone. Service is always fast and I always seem to get a different waitress. Don't know where they find these young ladies but they're good. I've seen different managers there and they are all quick and on top of things-which makes a good manager.\n   Since it's my daughter's fave I'm bumping it up from 4 to 5 stars."}
{"user_id": "amIUTkKQlA4464-lJlwlaQ", "business_id": "oRZzKWdyMQld6N_y4UWkAg", "stars": 4.0, "text": "Cinco de mayo means margaritas and sangria and all things fried... this great place does a nice job with combining flavors of several different ethnicities and backgrounds and develops recipes that are unique.  Although not touted as a \"Mexican\" destination they know how to rock the rock salt and pour that tequila.  They also just opened a wine bar a couple doors down for overflow and specialty bottles.  A high five for the on the rocks margaritas and house made white or red sangria - definitely worth the trip!"}
{"user_id": "L-2Qdi16eMRbATGDP6ADHg", "business_id": "mQvRi0nm84Www71d4qOheQ", "stars": 5.0, "text": "Excellent food. We tried three appetizers and five entries and all of them were a hit. This prices are reasonable and the service is good. I'd go back again and again."}
{"user_id": "FodM8aoGMQO2zsQCQxBTYQ", "business_id": "v5ktgWMAARaczTMh2rAJKg", "stars": 2.0, "text": "The service here has gone down. We used to go here a lot but now we go to another one. The service was slow and forgotten about."}
{"user_id": "zq2nd0H1dVzi3bta4Zepuw", "business_id": "JvawJ9bSr22xn4R9oLvl_w", "stars": 4.0, "text": "Took a while to get actual service but once we did I was happy. The gumbo was awesome and loved the chicken & waffles. Friendly staff and right on Bourbon St for good people watching!"}
{"user_id": "hWDybu_KvYLSdEFzGrniTw", "business_id": "roc-xyyzN5b_nImb0NdRLQ", "stars": 4.0, "text": "As airport grab-and-go restaurants are, Earl does a decent job with a variety of sandwich options including turkey, tuna and even a Hawaiian. But today I could smell the roast beef and so I got that one. Yum. Good portion of sliced beef that was beyond medium cooked with cheddar cheese and a yummy horseradish sauce. Nope, don't get lettuce or tomatoes on it. It's perfect the way it is.\n\nAnd since it's right between the security station and the top of the D gates (right near the Delta SkyClub!), it's easy to get and eat at the gate or on board."}
{"user_id": "1xS8Jj23zHx8axIVopG3wA", "business_id": "W4ZEKkva9HpAdZG88juwyQ", "stars": 4.0, "text": "Excellent.  Went there for lunch (the budget option).  Prix fixe menu was tempting.  Wife had the prime rib po'boy with the soup of the day (tomato fennel).  Both were excellent (the po'boy being an upscale interpretation, with gruyere and a really good horseradish sauce).  I had the seafood jamabalaya and seafood gumbo, also excellent (probably the best I've had)."}
{"user_id": "ftRgzVFzv6-TOCBXEOdWeQ", "business_id": "8uF-bhJFgT4Tn6DTb27viA", "stars": 5.0, "text": "Fantastic sliders!! Perfect size that you can try more than one!  Fried chicken slider, BLT slider, monte cristo and Cuban were all fantastic!  Now for Donuts to go!!"}
{"user_id": "7NHf3QgyGlZ_9pwdWLFdhA", "business_id": "QcuTCSfnI6WqKpuDL_a0OA", "stars": 5.0, "text": "Love this little shop so much for so many reasons. First off, whenever I'm on my way to Sweet Divas, I can smell the spices wafting from this little, inviting shop. Second, they have such a large range of spices that you can smell, taste a little, and purchase. Yes, there's a large overwhelming variety of spices, but fear not! Their knowledgeable staff is available and more than happy to assist you in finding the right spice you are looking for all your cooking needs. Over the years I've purchased many items from here and I can attest that they do last a long time (about a year, year and a half, including some stuff I use often!). I see all kind of specialty salts for example (onion salt, celery salt) as well as sugars and powders (lavender vanilla sugar, vanilla bean powder). Their products even seem to taste fresher (I can taste a difference between their cinnamon and nutmeg and what I can get at a dollar store, for example). The prices aren't too bad and they last long. My three bottles pictured cost about $19, but that will last a good year, so its worth it to me."}
{"user_id": "ci7Q6NvXQ8UZrBHusVX18g", "business_id": "V6Om7YZhlRQRU7WfuxHq8Q", "stars": 4.0, "text": "A wee bit pricey for the portions they serve. I come to Beck's for their gator gumbo over jambalaya. The whole thing is just so savory and the spices are just right. It's not overly spicy and not too salty as well. It's a great meal. The gator is in a sausage form. All chopped up into the gumbo. During this visit, I had to order their pasta. Chicken alfredo, for my 2 year old son. It was alright. The whole pasta tasted a bit dry. It's something I wouldn't get twice.\n\nVerdict - Gator gumbo, end of story."}
{"user_id": "n-lBS02-3yvlY5Q91mmwDA", "business_id": "2S_CEQYBbp8RO1bJm_1mng", "stars": 2.0, "text": "Hipsters unite!  I've never had a good time at The Taint, despite several people's attempts top tell me otherwise.  I'm not impressed by the apathy here, or the dirty-headed Garden District crapfest of regular clientele.  Boo."}
{"user_id": "0rZEWmL2rccd-N5VMzKLiQ", "business_id": "7T1VAYHIS3cgsDj3iS6JWQ", "stars": 4.0, "text": "Cute lil spot on Germantown Ave. I came in craving something sweet and they did not disappoint. There was an array of cookies and bars to choose from, if my memory serves me right. Behind the display of goodies there was a table with clear plastic cups filled with yumminess, labeled \"cake scrapple\" I was intrigued. They were different kinds of cakes and icings, most likely left over from a bake. There were about 5 different flavors to choose from and I went with my favorite Red Velvet with cream cheese frosting. I also ended up with an M&M cookie, my other fave! It was a nice day so I sat outside on their bench and had a couple bites of goodness! The cookie was great, soft & chewy with those hard candies for texture. The cake was also delicious and moist!"}
{"user_id": "tGMnQ1EnvZqpn_jAuN8VsA", "business_id": "7sKfrJmjG6unAQeWdQUe2w", "stars": 4.0, "text": "Love the sweet spiral plain pies at Franzones.  Can't go wrong with plain.  I tried the white pizza with onions in addition and it was a pleasant surprise.  The onions were a great addition to the pizza.  Same Franzone's as the Bridgeport one I grew up with."}
{"user_id": "qWSAH4MzFbHV6UsseJVlZg", "business_id": "dUctvEfHQccW_uxtRup2QQ", "stars": 1.0, "text": "I had a horrible experience here. The waiter was great but as I got my appetizer, there was it has a hair in it.\nNext the noodles came out mine was fine but my friend has a huge hair in his. I thought he was joking until he told me. After that it ruined my appetite, I gave the noodles back and they didn't even give me a new one, I thought I should've got the food for free at that point.. never eating here again"}
{"user_id": "AGyh5jnM0zrIElY7aZQafQ", "business_id": "5ezrDoezdUlJpUa5Jg6dUQ", "stars": 5.0, "text": "Went here with a friend after having an incredible experience at Laurel and was hoping for more of the same at a slightly less bulgy pricepoint, and oh my, is it worth it...    ITV is the kind of place that i dream about, beautiful small room, dimly lit but you can see ( as opposed to some places) and you want to see everything.  Everything in the room is beautiful including a lot of the staff, (im trying to give you the full picture here).   First thing to hit the table (or bar in this case) was a three dollar beef fat biscuit that was the best thing ive eaten in this city all year.  I verbally communicated that message to Chef Nick Elmi who graced us with his presence in the dining room (just as before at Laurel).    We went on to eat many more things which i will try to name now... Stars were Foie with Apricot Miso, Pork Cheeks with some insanely good vegetables, trout pumpernickel soldiers and one of the best cocktails ive had in a damn long time, the ouroboros.   The are playing around with cold smoking things in there and on their BAR MENU!   Honestly, place is just terrific and i meant to write this review sooner but hey... better late than never.  Now that i think of it, im getting hungry... maybe ill head to East Passyunk for some of the best this city has to offer!"}
{"user_id": "CNyXcn0c0V5CFmigqqw-Xg", "business_id": "oY5LFo6Yxxf32ePna6mEUQ", "stars": 5.0, "text": "I absolutely love this place!\n\nGreat hours, impeccably clean, so relaxing."}
{"user_id": "0XmgOinrZWNO15DlimRQeg", "business_id": "PpZqlVUAP2i8_hNfpQyKhg", "stars": 5.0, "text": "Buckingham Pizza makes the best pizza around, particularly its plain pizza and a few of its specialities -- try the cool ranch pizza. This is a pizza parlor. Don't get fancy....order the pizzas and maybe some sides. While some of the entrees are good (chicken piccata), stay with the pizza and you'll love it."}
{"user_id": "FqnSr3rWenjnF9taWyiHTQ", "business_id": "LnQRfj3pPz0369stRnwUWw", "stars": 5.0, "text": "Very good sushi. The peanut avocado roll is a must try. Delicious! I ordered the Volcano roll as well and it was amazing. The service was also great, very friendly customer service. I will definitely visit again even though it's far from where I live. If you find yourself near Valrico, then definitely visit this restaurant. You will not regret it."}
{"user_id": "yyxEa8y4HGij_m7g1wDKWg", "business_id": "Jc6MxMyCLp4DMfN4C1t1aQ", "stars": 3.0, "text": "It's really a run of the middle as far as Cuban food goes. Not bad but not great either. I work close by so I end up there for lunch quite a bit. It's definitely worth checking out for lunch as their specials change every day and prepared freshly."}
{"user_id": "L-FS5xwHyvJINnt-QvuR2Q", "business_id": "y7qvy9LcyK2hr_VcPBiPaQ", "stars": 5.0, "text": "Bought my beautiful new bike from this shop a few weeks ago then promptly crashed it (curse you, trolley tracks!). I brought it back to the shop this afternoon to see if there was any way they could try to fix the front basket, which was pretty mangled, and to give the bike a once-over to make sure it was safe to ride. I was expecting to have to leave the bike with them for a few days, but the whole process took less than a half hour. Not only did they fix the basket (not perfect, but pretty damn close), but they also fixed the gear shifter that was a little out of whack... FOR FREE.  I couldn't believe it. \n\nI also want to note that everyone in the shop- from the owners, to the sales people on the floor, to the mechanics, to the dog that greets you at the door- is so friendly and welcoming. I am so happy I found them."}
{"user_id": "eHIDCdEzbZW4tHk4Iegwag", "business_id": "kKPJLiHIr9Gd9sYs3GhxDQ", "stars": 4.0, "text": "Finally got to eat here last night. Eclectic foodie menu. I had their onion tart as an app and Kerry had the veal meatballs with sauce on polenta, very delicious. The red gravy tasted like my own. We both ordered the special of citrus short ribs with fat noodles and brussel sprouts, peas. couldn't finish we will be back to try other interesting items. Small crowded but great friendly atmosphere"}
{"user_id": "VMtyZjaEJB9nfmjr4xdVlw", "business_id": "GBTPC53ZrG1ZBY3DT8Mbcw", "stars": 4.0, "text": "First meal in New Orleans. I had the $15 lunch special, a seafood stew (with oyster meat, crab claws, shrimp, and redfish) that came with a surprisingly thoughtful salad. Yeah, it's weird: I'm not even a fan of seafood and, to be honest, I wasn't even really that hungry. Still, before I knew what I was doing I had wolfed down the entire thing. The spice, consistency, tenderness of the meat -- all was precisely just right. Well worth your while."}
{"user_id": "cARxOd_5yKCgsCbUZ5ED4Q", "business_id": "EtKSTHV5Qx_Q7Aur9o4kQQ", "stars": 4.0, "text": "There is a great selection of whiskey/bourbon to suit anyone's taste. We had burgers with the fried egg on it and it was soo good and probably one of the best burgers I've ever had. The duck fries are a MUST if you come here. It is a cute atmosphere although we went with a party of 4 and it was a tad awkward the way our seating was and made it difficult to have conversation with everyone at our table. Overall, a nice place to go. We will be going back."}
{"user_id": "fS6uDSnfwYNHkMOWXQmzJw", "business_id": "j8JOZvfeHEfUWq3gEz6ABQ", "stars": 5.0, "text": "I absolutely love coming here. Great outdoor place with a wine selection you can't find anywhere else (not your typical wines you find in the grocery). The live music today was fabulous - and on a Thursday afternoon! Come here, get a few cheeses and wine and you will be satisfied. Oh, and the regular menu is crafty and artistic. It's a beautiful place with ambiance and on the palate."}
{"user_id": "E2CuwvUZdhvrAvvNdmmN8A", "business_id": "eS4billU3Yd9hoVUFfZFbA", "stars": 2.0, "text": "I love Skyline Chili.  I first had this stuff in Cincinnati, and I was thrilled to when a location opened in Clearwater. \n\nThis particular Skyline, however, is not great.  The service is generally poor, and the food comes out very slowly.   It seems like every time that I go, they are \"out\" of something, or some equipment isn't working.  Sometimes it's baked potatoes, sometimes it is french fries, sometimes it is something else.\n\nLove the cheese coney hot dogs all the way!\n\nI hope this location can get their act together."}
{"user_id": "w-rWlc4l1T6Q1GKzdNZrcA", "business_id": "Jx2AoB_IQOUrZ3s6fdAUSA", "stars": 5.0, "text": "Love it here! Their sips mocha is my go-to. Staff has always been so nice! Absolutely love that they have a drive thru too, helps not to unload my kiddos. Oh and their cakes are amazing too!"}
{"user_id": "62chMGLC5sW48gDBsm_aSw", "business_id": "N2i1U4Z6GHEw9V02N2u6JA", "stars": 5.0, "text": "We used The Hollander Hotel for our wedding hotel and it was an absolutely incredible experience.  I will never get tired of raving about our experience.  We were honored to use the Hollander not only for our room block and wedding night suite, but we also used the Tap Room as our after-party location and we hosted a brunch for our guests on the beautiful patio on Sunday morning after the wedding.  Everything was perfection and if we could do it all over again, we wouldn't change a thing!\n\nThe hotel property is absolutely charming.  The décor in the lobby is beautiful, eclectic, and very welcoming.  The Tap Room is a great place for people to gather with intimate booths and large tables for bigger parties.  The Bar has an amazing selection of local and craft beers and the servers and bartenders are all professional and fast! We were able to use the Lobby and Tap Room for some of our wedding photographs too, and they all look wonderful!\n\nThe rooms are very pleasant and quaint and our guests all complimented on how clean and cozy they were.  The prices were also wonderful and our guests were able to enjoy downtown St. Pete because of the great location.  The shuttle is also very convenient and a great experience for guests!\n\nThe brunch was perfect.  Not only was the price great for an all-you-can-enjoy feast, but the food is delicious and homemade.  The wonderful gentleman who makes the omelets is friendly, fast, and takes great pride in his work.  He is also a talented baker and I couldn't get enough of the chocolate muffins he made!  The service at the new coffee/dessert café was wonderful!  The Patio was a great place to visit with our guests and enjoy the beautiful St. Pete weather. We look forward to many more brunches there in the future! \n\nFinally, the best part of all is the management and team at the Hollander.  Nick and Will treated us like their own family.  They went above and beyond to ensure that each of our guests felt like they were at home and comfortable.  Zach at the front desk was so friendly and patient with me as I called checking on our room block.  The entire team was just a delight and so very accommodating.  They take great pride in ensuring that every guest has a wonderful experience.  We just adore everyone there!  I absolutely loved working with them and would recommend this beautiful hotel to anyone!"}
{"user_id": "11xwVSDv1ytjcyvUiyBWaw", "business_id": "-OIUunijjcq_ZzyyQhPPFQ", "stars": 1.0, "text": "I got the gyro \"platter\" for lunch, which was dry, uninspired, and nothing like a deconstructed gyro. Worst of all, it came with \"vegetables\" which looked more like poop. Tasted that way, too. There are better places in Fairmount for lunch, and they won't serve you poop, either."}
{"user_id": "Wbuln6K4xlwyj5WMoYdjNw", "business_id": "gK9CdFaCXmHoW8aLfXiSqg", "stars": 4.0, "text": "I went there for drinks and found the environment really nice with the brewery right there. The beer was good and the waiter was very knowledgable and kind"}
{"user_id": "BBTexIhkFIYnS0rd56vsKQ", "business_id": "W4ZEKkva9HpAdZG88juwyQ", "stars": 5.0, "text": "OMG! What an amazing dinner experience. A friend recommended this place and it was incredible. We had two of their signature dishes -- the BBQ shrimp and bread pudding. This is a fantastic restaurant with great ambience and fantastic service. Highly recommend it if you're visiting New Orleans. Their fried green tomato appetizer was a great way to kick off the meal."}
{"user_id": "vr-Rw3nMKIgGrVNT6A7p9g", "business_id": "tQYOAfl33tmP4oWpfyRr6g", "stars": 5.0, "text": "Although there are countless little Mexican places below Washington Avenue, I never get sick of them and always look forward to trying the new kid on the block. This time it was El Sabor Poblano on Federal, which could not look less special if it tried.\n\nI liked that there were 3 fish tacos on the menu.  I picked the fried and battered version, though the tortilla chip covered fish could have been awesome. I was instantly impressed when I opened one of my three and found that El Sabor puts an entire filet of fish in each taco! The flakey meat had no fishy taste. These tacos came with the more American toppings of lettuce and, tomato, and cheese. I bet I could have gotten cilantro and onion if I asked. The sole staff member in the place seemed happy to accommodate us- well, we were the only ones dining in.\n\nAnother taco filling option that comes with more traditional toppings is the super crispy chorizo, only $8 for 3. There was no detectable gristle here, something I have often come across at this little places.\n\nAs unassuming as it looks, this particular South Philly Mexican place is worth stopping by."}
{"user_id": "d0FbFaZuJWfai0RYsUS7qw", "business_id": "N9-NRK8PPvi73tduxoPKbA", "stars": 3.0, "text": "By far some of the most comfy theater recliners. My only complaint is that you have to put your feet down if someone wants to pass by you on the aisle. The bartender at the little lounge next to the theaters is a delight. And being able to drink in the theater is a nice plus. The drawback comes with concessions. At a peak time on a Saturday, there were 5-6 employees at the counter but utter disorganization and no hustle whatsoever. The popcorn was also burnt. Next time I'll eat beforehand and stick with the bar."}
{"user_id": "N1gb_Cx98QrcfA4CPrkY2w", "business_id": "QkyEr9j7il9lJqseTbPe5w", "stars": 1.0, "text": "I went here when if first opened, and have never desired to go back again, I was so very disappointed at the quality and the taste of the food. I would absolutely not recommend dining here."}
{"user_id": "jHcTMCmyetM7HSC7weQTlg", "business_id": "y44MbCvvtmg1FpkNGSWisw", "stars": 2.0, "text": "Hate to be harsh but dang! After having a limited selection at terminal F I finally decided to go with Tony Luke's. I was looking forward in trying there Philly Cheese Steak been in Philly and all. So I unraveled the sandwich and to no surprise the sandwich I got didn't look nothing like the picture on the overhead display of the sandwich. The part that got me even more was the meat. I don't know what it taste like to eat dog food, but I am sure I just paid $10 for it."}
{"user_id": "V8P2-U2IINNHzALqjaN3gQ", "business_id": "GyC36Pn0Q1-qHnqXys6yFg", "stars": 3.0, "text": "It's my first time here and the service is slow. The employees don't have good attitude but the food it's good."}
{"user_id": "WBR41ZUpnl4hW5stYd5E2A", "business_id": "ncxN9II-MeXRudUrE3GVsA", "stars": 3.0, "text": "I was here a few times before and didn't review. I come here for the food, NOT the service. The establishment is lacking in its service. Their food is always great though! Very delicious for a dive bar."}
{"user_id": "ndgHYecgAWEqtjnjE7LtfA", "business_id": "MMRRS6YhVRx_iN5-JhMRYg", "stars": 4.0, "text": "The new Han Dynasty took over the spot where the old Mid-Atlantic restaurant (with the unchanging menu) was. I like the Han Dynasty here a lot more than the one in Olde City even if I give both 4*. Maybe I'm biased, because I love the service here. They've always been very nice, and came over to check in with me and just make some small conversation when they heard I had a peanut allergy (even though they had no peanuts in any of the dishes I ordered; I think it was Han's sister?). I've been to this Han Dynasty more times in a month than the number of times I've been to the other.\n\nNote though, that the different branches have different specialties. I heard the dan dan mian in Olde City is the best, but the one in UC isn't so good (I wouldn't know since it has peanuts). Overall, I think it;s okay food wise, still not spicy enough as with the other branch. But I like the layout and atmosphere a lot more.\n\nNext, if you go during lunch, you can ask for lunch portions, that are smaller than the dinner portions, and half the menu price! So it's a great lunch place too, alone, or in a group of 2 or 3."}
{"user_id": "FnrhqXJXR9xnYe6vgrKoCw", "business_id": "b7V_5q22_eTeHlYzq1bpFw", "stars": 3.0, "text": "Husband and I made a mistake and came here on a Lenten Friday. The wait was forever. But since we were already there, might as well suck it up and see what's it all about. We ordered the blackened alligator and oysters for appetizers, the alligator came out within 15 minutes, and it was alright. A bit too greasy. Then another 15 minutes later, our raw oysters came out, I wanted mine char grilled but the waitress didn't mention they don't have char grilled oysters and still took my order, so I thought I was waiting for mine to be cooked the entire time. When she brought out the two half-dozen raw oyster trays, that's when she told me they only have raw oysters there. SMH. I have sensitive stomach so I only had 3 then gave the rest to my husband. Regardless, the oysters were really fresh. We waited for at least another 20 minutes later for our entrees to come out. At this point, I was really hungry and had hoped we were at home eating ramen noodles instead. My husband had the roast beef po-boy, and I had the tuna and shrimp kabob. My husband told me his roast beef was really salty and while ironically, my kabob was very bland. The kabob came with exactly 3 pieces of cubed tuna, 2 medium size shrimp with plenty of bell peppers and onions in between, and baby shrimp creole with rice. For the ok price, I shouldn't complain too much about this place. Didn't try their seafood boil, but it looked like that would have been a better choice."}
{"user_id": "wABHp4fGUC-0acRKhmQO2A", "business_id": "MMRRS6YhVRx_iN5-JhMRYg", "stars": 5.0, "text": "Awesome food, great place to split a bunch of delicious spicy, ultra flavorful dishes with a large group. It's the Chinese restaurant a lot of people know about for good reason - I haven't had a single bad dish here, and it's always a crowd-pleaser."}
{"user_id": "jRdjx0aHuXeBnfhoo8AKTQ", "business_id": "oh2wCX3pzTTEYaynLgmMQw", "stars": 3.0, "text": "I got a cheap haircut in NY for next to nothing and what do you know. it looks like some crazy chimp chewed up my hair and spat  it back on my raw scalp.\n\nSince I'm going for job interviews, I needed to look better and went to Domenick's. The guys were great, Robert cut my hair and did a clean job. Bill came out to $35. I'd give it a 4, but it was a little pricy for my taste, but I look human again. Don't know what you guys in Philly normally pay for a haircut."}
{"user_id": "OfhZlqYMrCVAhM-bt_cQug", "business_id": "J-ciDDEdIHMcChGIyKZnOg", "stars": 4.0, "text": "Beautiful clean shop with knock your socks off Everything ...\nHomemade breakfast tarts and chicken pot pies .\nAll sweets looked well beyond beautiful and delish.\nI felt some of the items were a tad pricey considering the sizes being on a smaller size. But I know premium quality costs more .. \nIt's a great place for locals and worth a trip if traveling from center city etc .\nI found counter staff to be most friendly and engaging \nWill be back and certainly will recommend"}
{"user_id": "QuZKJnltihmZ8jhwfxPeJA", "business_id": "QWqKTWQ2OiDgo3dzNkpung", "stars": 5.0, "text": "The best soon-dubu in the city!  This place is tucked away and once you walk in, it's like you've stepped into a Korean home.  Very welcoming, warm and inviting.\n\nIt's very vegetarian friendly!  The soft tofu is stewed and put into the dol sot pots which each and every stew feels like it's custom made for you. \n\nYou can select from beef, seafood or mixed meats (seafood & beef), mushroom, and just plain.  They can adjust the spice as needed too.  I always get the extra hot with the hot temperature, can't beat it.  The rice also comes in a dol-sot which is great if you leave it in for a while, it burns the rice into a nice crispy shell.  DROOL.\n\nJust thinking about this place makes my mouth salivate!  \n\nIf you're not into tofu, they also offer korean bbq meats (cooked in the back), with other soup/stew items.\n\nLove this place!!!"}
{"user_id": "avQwKRvXc21koLCbahFEig", "business_id": "AY1SyySRyTnBwBdf7qfGxQ", "stars": 5.0, "text": "From the second you walk in the door, you're greeted by the adorable woman at the counter. It seems if you come in here more than once a week, she'll know you're name but I haven't been so lucky since my visits are a bit more sporadic.\n\nMy most recent discovery are the vegetarian breakfast sandwiches, which are served all day! I particularly enjoy veg. sausage w/ havarti on an everything bagel. I could actually go for one right about now... I've also had the veggie club sandwich and my other half has enjoyed the chicken cheesesteak hoagie and the chicken salad on a croissant. Everything always taste fresh, they are priced really well  (I think my favorite bagel sandwich I mentioned is $2.09-2.99- cheaper than wawa!). The people at the deli are super helpful, offering menus if you can't read the one on the wall and will make great suggestions and accommodations to your needs and want.\n\nDon't forget to grab a really great snack too while you're there- they have amazing chocolate bars, an incredible drink case, tons of chip varieties and those addictive hi-chew candies in every flavor.\n\nI know i'll be back here, who doesn't like fast / delicious / attentive service?"}
{"user_id": "dXgGp-vjO_TSIvLgNz5uaw", "business_id": "o3RGMdSY37_PX1k1vZsXpA", "stars": 5.0, "text": "This place is a hidden gem.  It is located in a strip mall, but this restaurant is anything but a strip mall restaurant.   My husband took me here for my birthday and I was blown away with the whole experience.  It's a very modern, romantic atmosphere.  The food is excellent.  I was shocked by the Fois gras-amazing.  I had the prix fixe menu and I loved ordering 3 courses.  The short ribs were great, but I want to try something new next time.  The desserts were awesome.  I usually take caramel, but there was a caramel tart that was to die for.  Can't wait to go back!!!!"}
{"user_id": "t77iaBQb3pyj2rtwffiLEg", "business_id": "ZnAr0AxYpEYK1ZHNc4fk7g", "stars": 2.0, "text": "We stopped at Tako due to the positive reviews on yelp. We brought a bottle of white wine with us, the staff did not bring a ice or a chill bucket for us. It took 45 minutes for our appetizers to come out. The edamame was over cooked and mushy while the spring roll did not look appetizing almost like it was frozen. I could buy better spring rolls from trader joes.\nNext we moved on to our sushi which was sat on the sushi bar for 15 minutes before it was brought to us. The sushi it self was good, but not the best I have ever had,\nIf I came here again I would not buy any appetizers. The service was slow"}
{"user_id": "fr1Hz2acAb3OaL3l6DyKNg", "business_id": "T3muepcwD45gHLWcpaNNDQ", "stars": 4.0, "text": "See's candies is California base bakery reach Florida. I know about this candies when my wife living in California. Their chocolate is very soft and tasty. \n\nIn Tampa, the International Plaza Mall has this temporary store from Thanksgiving to Easter. They located very close to H&M clothing store. You can have samples before you buy it. I got the lollipop candies. I also bought one assorted chocolate candies. They are very good. The store clerk was kind enough to let us try their assorted chocolate other their typical sample candies. \n\nYou can go with chocolate with nut, mint, toffee, milk, white or dark chocolate. All are good. Guilty pleasure with a touch at sweet side. Mail order through the web also available. If you close to the mall, just go to buy one without shipping."}
{"user_id": "JggphOM7FIbvUyPcsfcNTw", "business_id": "9gObo5ltOMo6UgsaXaHPWA", "stars": 5.0, "text": "Second stop for Center City Restaurant Week:  R2L, dinner for $35 each. \n\nOn the 37th floor of Two Liberty Place is a very fancy-cool restaurant/lounge where you can get a bird's eye view of the city! Group of us went to dinner here together after a day of meetings. Didn't get one of the tables facing the windows, but still had great views of the sunset and city by night. Again, multiple choices for the three courses, but I chose to start with the crisp peas/ham/garlic risotto [balls]. Main course was the Butcher's Filet (braised short rib + Steuben bean chili, potato/farm veg slaw and basil), which was quite heavy since there was also meat in the chili as well. The dazzling dessert to finish it off was the milk chocolate + hazelnut pudding served with salted caramel and coffee to melt the chocolate, and candied almonds on the side. A bottle of wine for the table as well. Food was great, waiter was awesome (making sure to warn me that the risotto came in ball form rather than a bowl, for instance), very classy experience."}
{"user_id": "BmThnFPDalpbC1x98aXKaw", "business_id": "VbItL6RDULtnw4YvB6EhVg", "stars": 1.0, "text": "They served me a frozen pizza and skunked beer.  'Nuff said."}
{"user_id": "V5N8EVTjBlCiUzD72Rov2Q", "business_id": "V378VWx4D8BstWNRFwDULg", "stars": 1.0, "text": "Whole family got sick after eating here. The frozen yogurt was pretty but did not taste good. Would not go here again or recommend it."}
{"user_id": "ovUBZdJI16y-qasoqnGt5Q", "business_id": "2S_CEQYBbp8RO1bJm_1mng", "stars": 3.0, "text": "Uhhhhh.... Not sure how to quantify or qualify my experience here. Let's start with back story: \n\nMy sister was visiting for the weekend, so I wanted to show her a solid night on the town that lasted till the wee hours of the morning. We started on Frenchmen, but for whatever reason it was dead. \nDeciding to adventure Uptown we proceeded on a respectable bar crawl, including Delachaise, Columns, and St. Joes, however, at 3 AM the usual Uptown culprits start to raise their heads. A summary of the following dialogue:\n\nFriends \"Let's go to FMs\" \nMe: \"No, too much broken glass\"\nFriends: \"Let's go to Snake and Jake's\"\nMe: \"Eh....\"\nFriends: \"Brothers 3?\"\nMe: \"I'm afraid I'll hit my head on the ceiling\"\nFriends: \"The Saint!!\"\nMe: \"I suppose I haven't been there before, I'm curious.\"\n\nAfter entering the Saint the look on my sisters face was priceless, akin to a deer in headlights look. I kept my countenance, and we ordered a round. Things proceeded as expected ... unwanted dance grinding advances, check! uber drunk guy talking your ear off, check! Big Buck Hunter, CHECK!!! Overall I'm glad I moderately traumatized my sister and sated my curiosity in the same night. \n\nHelpful hint: They have outdoor seating, surprisingly, which is very good to escape the smoke"}
{"user_id": "av5_rihz1f5DLEIt5NrtNA", "business_id": "9gObo5ltOMo6UgsaXaHPWA", "stars": 2.0, "text": "Walked into the restaurant, with reservations, and many open tables.  I asked the manager for a window table and was responded with \"they are all reserved.\"  Two hours later, when we left, still many open tables next to the windows.\n\nOverall food was good.\nI had the filet and she had the salmon.\nThe bottle of wine that was recommended was $75 and was not told prior to ordering it, just that it was the last bottle."}
{"user_id": "Q1WRnsP8net9hJ-IkU9-4A", "business_id": "SuQgcpL-aZeuyRjBdA0pHw", "stars": 1.0, "text": "What a disappointment. This place was not good I would suggest you think twice before selecting this option. The manager and wait staff may possibly be the worst I have ever encountered, rude and definitely not focused on customer service.  The manager is a very angry hostile fella I asked if I could get brown rice instead of white and he blasted me...I offered to pay extra and he stormed off? Do not know what the deal was but this is just plain unprofessional and creepy behavior. The waitresses will smack into you while you are eating...man what a mess this place is from top to bottom.\nThe food just OK at best! I am seriously complimenting them here... you can do better at home than here. Seriously I am not going to go into you have been warned just yuk...OK? these other folks with the positive reviews for this place must burn off their taste buds with adult beverages. (Didn't try the sake it may be the high point of the joint...but why would I want to expose my taste buds to a substandard meal to enjoy some rice wine? I can do this at home.\n Here is something I am not sure of, I have only lived here a few months now, is it customary to charge for each soda every time you get a refill here? I was charged for each I asked why they said \"This is how we do it here.\" So at $2 bucks per 6-8 ounces of beverage you may want to go with water at this place...but smarter yet! Go elsewhere.\nI will not be returning to this establishment.\n\nWorst yet."}
{"user_id": "P6f_pFhxb0jwtA1JmjHmJw", "business_id": "uyQGW7kZKk90vEwGo8A7mA", "stars": 1.0, "text": "I had the worst experience of my life and it's not over yet.  I made a mistake in purchasing a vehicle that is out of my budget on a Friday afternoon.  By Sunday after review of my budget I realized I was unable to afford the car.  I called the salesman and tried to explain my situation at 11:30am.  He stated he would speak with his manager and call me back.  At 3:30 after no return call, I called him again, no answer. I left a voicemail and still no call at closing time.  Monday morning I arrived at the dealership as they were opening.  I asked Stephen, the salesman what they determined.  He instructed me to have a seat and he would talk to his management team.  One hour + later, I was called into a cubicle and told my loan had been funded and the title had been changed.  Therefore, I would have to sell the car back to the dealership as a used car.  I would lose a lot of money in doing this.  This morning, Bill head of finance advised that the bank had questions about funding the loan.  I received a call from the bank stating the loan had NOT been funded and they would be unable to okay the loan.  I have left numerous messages with the dealership and have yet to receive a callback.  I contacted an attorney and per his review I again called the dealership and asked for a time to return the vehicle and take back my trade.  Still no response!  These people will lie to your face, avoid this dealership!!"}
{"user_id": "BOM58nAhmaoOC_Si4u4lOw", "business_id": "8-j10_I745ITrczbkfD-Pw", "stars": 4.0, "text": "I have been a patron of Desi Village in West Philly for years.  After moving the suburbs, we saw the KOP Desi Village and finally tried it.  We were skeptical having also tried Mood Cafe (owned by the W.Philly folks), and it wasn't as good. But the KOP location is actually very comparable to the West Philly location.  \n\nThere is no ambiance or atmosphere here.  The strip mall where it's located is pretty depressing.  Desi Village may be the only active store in it.  And its decor is tired and old.  It is a big space and it appears they do a big lunch buffet but I'm curious if it's ever full.  So don't go for the ambiance.\n\nBut the food is good.  We ordered some Keema Naan, Samosas, Saag Paneer, and Lamb Biryani.  All of it was really good.  Perfectly seasoned, not too oily, and appropriately spicy.  I have a nut allergy and made them aware of that and they did not screw it up (most Indian restaurants do).  So we'll definitely be back.  It would be great if they moved into nicer digs but the food is what is most important."}
{"user_id": "_BcWyKQL16ndpBdggh2kNA", "business_id": "tD_2Pw2kiUGE-lIkFTQKLw", "stars": 3.0, "text": "Got an estimate but went with another plumber as this was the highest quote of the 3 plumbers we interviewed for the job.\nVery prompt communication though.\n\nWill re-consider for future jobs.  Seems reliable (and often you get what you pay for!)"}
{"user_id": "jDLeW4d-8WqMkikCTHFJ5g", "business_id": "kJpoduG3wdA35WzOF_T1Aw", "stars": 5.0, "text": "Only the best Mexican food in Florida!!!!  Since the first day I tried it I love it I keep coming back!!!"}
{"user_id": "Wshkpj8aHWuzIeca1QxWTA", "business_id": "R-HCwu9UbasUudG1yTM1Ow", "stars": 1.0, "text": "I am positively LIVID.\n\nI went to check my account balance and what do I see? An overdraft fee of $220.\nHow could this happen? My card was never declined and there are two large fees deducted from my account.\n\nI called TD and sat on hold for 45 MINUTES. I don't have that kind of time. Granted, the guy that was with me was nice and helpful, but never mentioned anything about the wait time until I brought it up. I asked about these fees and he said \"Just so you are aware, TD Bank's new policy is that when you have insufficient funds, your card will not be declined. It will be run through, and you will be charged an overdraft fee.\"\nOH THANK YOU FOR TELLING ME NOW, JERK.\n\nI have too many salty words that are unacceptable in the public domain, so I'll stop now.\n\nNeedless to say, I am switching banks.\n\nSort of UPDATE:\nI thought you Yelpers would like to know that last night, when I was depositing the cash that I didn't have into my account via ATM, I flipped off the cameras.\nTAKE THAT, TD."}
{"user_id": "d9enV9vczP57YFObuHTn_g", "business_id": "KIph7iH97vnDrgcdaqEMFQ", "stars": 2.0, "text": "I can walk here and won't go back even if they were the only place open at 2am.  I got the basic general tso's and it didn't come close to passing the test.  Go to East Cuisine."}
{"user_id": "b-DA7VhnYRLg6q5jIK3RNw", "business_id": "AzseSGgDC6bVtMPEYo1CNQ", "stars": 4.0, "text": "The flavors continue to surprise me. I had Bananas Foster, Pear Champagne Sorbet, Blueberry Fig Sorbet, and Cassis sorbet. All flavors were good but the Cassis started off quite subtly and then the flavor gradually made itself known; the more I ate of it the better it tasted. It was well worth coming back with another group of friends to sample some frozen happiness."}
{"user_id": "1Lj6Ra9quyrH1gIxACliPw", "business_id": "KSP4BhUnu-skBxlRT9MLRQ", "stars": 1.0, "text": "Only had one experience with this place and it will be my last. I called in the night before to ask if they sell deboned duck and the man on the phone said they could but I would have to request it the day of. I called the following morning to ask to pick up a plain deboned duck and whoever the incompetent girl who answered had trouble getting my order clear. I picked up my order and came home to find that not only did they gave a whole duck with stuffing I never asked for. I called the place back and thy never offered any compensation of any sort except a trade in right as it's a hour before dinner time and the butcher shop is more than thirty minutes away for me. Shame that food from this place is overshadowed by their terrible customer service."}
{"user_id": "nGO8Re5IpOosHdWPqn8vWQ", "business_id": "Uc6PdjT_MO5bRPQsUUEy5Q", "stars": 4.0, "text": "We loved the food, service and decor! The minute we walked in for a late lunch we were greeted with a huge smile and a warm welcome from the manager. Our server, Christina (i think that was her name) was delightful. The beer selection was great. We had the chicken rabe sandwhich and pepperoni pizza. The sandwhich was very good, on tasty foccacia bread. The pizza was superb!  We love the \"well done\" taste. We will definately be back. One problem we may have is our 7 year old is very picky and we didn't see a chidren's menu."}
{"user_id": "FncS5xs9sE1weGrYV4aJgg", "business_id": "eaV07HGOcyb27XobHVl8LQ", "stars": 3.0, "text": "I regularly go to student salons for hair cuts and styling. \n\nI have long, fine, mostly straight Asian hair, and have had mixed results from the Aveda Institute -- to be expected considering I had a different stylist in every case.\n\nJust know that if you haven't had a student stylist before, don't expect perfection. Do expect the cut to take an inordinately long time compared to a seasoned professional -- most of my cuts/styles have taken around 2 hours. The basic cut price includes massaging wash, cut, and blowdry style, plus the stylists do take the time to check in with their teachers and make sure the cut is going the way you want it to. Another plus: all of the stylists I've had at the Aveda Institute have been professional and committed to their service, which isn't always the case at other schools. And the prices are right."}
{"user_id": "__GHy1xxetn0SBqP4b_odA", "business_id": "L3V21nAe-CicW2bvtNWa0g", "stars": 3.0, "text": "Not the best prepared sushi inthe city by a longshot, but for quick (and I mean quick), cheap sushi with a long menu, Mixx is great."}
{"user_id": "gv0coNUFY-fibRwP8IKqPA", "business_id": "qdL-EbgoA7Gq_2u4e4YvLw", "stars": 3.0, "text": "Harry's blue bell is a nice spot. We stopped a few days ago for a quick dinner. It's tucked in the corner of a shopping center and it's very easy to miss. It was packed and seemed like the place to be for locals. The inside is nice but small, only a few tables in the entire place. The service was just okay. \n\nThe beer selection is very good as are the prices on the beer. The food menu was a bit limited with you're basic bar food. The wife went with the bbq pulled pork and I went with the chicken and honey mustard wrap. The bbq pork was good, the bun was nicely toasted but the sauce was overly sweet for our liking. The wrap was fresh and good but nothing spectacular. The fries were hot and crispy. The kale slaw was fantastic but a very small portion.\n\nOverall it was a decent meal. I wouldn't go out of my way to go back. If I were in the area I'd stop though. Solid 3 stars."}
{"user_id": "nyjj6EHn29se2IE8c_Wq4A", "business_id": "2K75poiMupFTvpQq5REWTA", "stars": 5.0, "text": "Just an update regarding the only complaint in my first review of Kajuns: the smoke. They've since installed a couple of smoke eaters that have made the air extremely breathable for people who, like me, have sensitivities to cigarette smoke. I previously would get headaches because of the smoke if I stayed at Kajuns too long, as I am wont to do, but now I can hardly notice that people are smoking while I'm sitting inside the bar! (When I leave, it's a different story as my clothes still smell like smoke, but that's a compromise I am willing to make.) Just goes to show you how dedicated the Kajuns staff is to improving the experiences of their customers. Thank you Kajuns!"}
{"user_id": "fr1Hz2acAb3OaL3l6DyKNg", "business_id": "t-bcEvAM8oE92tm9HBr7wQ", "stars": 3.0, "text": "We have big group of 12 for the office outing lunch. I would said for the number of people we have, the service is not the best but good enough. Only one of our members get the food late. The close out may need to work on it. Tip was added since we have large group which may my bill easy. \n\nI have order the lamb kebab (Shish Kebab) plate. It come with two choices of side. I got the rice and the babaghanoush. The rice was well cook and nice aroma. The babaghanoush was well prepared and great with extra olive oil. The presentation of the dish is pleasant. However, the meat did not measured up. It was too dry and the marinated is not over the top. They need to improve on this area. \n\nI have been here several time. My previous experience is better. During the month of Ramadan, they serve the buffet that are plenty of choices and attractive. I would said try them during this time. The buffet of Ramadan usually start at 8:30. Go early because is a lot of customers."}
{"user_id": "gL0PnnFMmJbWphaOh_6BsQ", "business_id": "Mha77MN_BYGB-w7DONZ5YA", "stars": 4.0, "text": "This review is mainly chicken talk as Cuenelli's Peruvian Style Rotisserie Chicken brings to the table. Pollo a la brasa.... Rotisserie chicken.... Whatever you wanna call it.... I call it a technique done here with love and pride. Lets be clear, you will find no comparison coming from your grocer deli section or at the checkout isle.\n\nWhy do I think this chicken have some TLC put into it? On biting down of this chicken you can note seasoning flavors down to the bone. This is an inclination that prior to even getting into the rotisserie oven, these birds spend some time in some form of marinating process. Building flavor, the chicken also has a seasoning rub all over the skin.\n\nLets go to this rotisserie oven. Another unique element is this oven has a charcoal or grill like component. This gives the chicken a smoky element in the flavor build. As these birds turn in this oven, they keep moist from the natural drippings dropping from bird to bird as they rotate through this oven. In turn, this a reason why some people may note some pieces the skin end up dry and crispy and others get moist or soggy skin on their chicken In the end, you end up with this tender, smoky, well seasoned, fall off the bone goodness. Wait.... how can they add more flavor? Cuenelli's serves it with two dipping sauces, a chimichurri  which gives a herbaceous and slightly spicy flavor, and an aioli which has a garlicky - lemony element.\n\nRound out this meal with some solid sides. Must haves for me would be the cilantro rice. Another herbaceous addition that works well with this meal. I got to use the word herbaceous a few times in this review, it has reflects such great imagery for food talk:) Must have beans with rice no? I pick the spicy pinto beans over the black beans at this establishment but lets be clear these beans are pretty spicy. I also love the maduros here. These sweet plantatains are cooked to perfection where the outsides has this caramelization from the natural sugar of the sweet plantain, leaving you with this toffee-like, stick to your tooth exterior and soft and sweet interior. \n\nWash all down with Inca cola or a bottle of chicha limena.  Inca cola is almost like a cola champagne or a cream soda type of drink. Chicha Limena I say is Christmas in a bottle. This juice has a floral base blended with cinnamon and cloves.\n\nThough Cuenelli's Peruvian Style Rotisserie Chicken have many other notable Latin dishes, the one thing that comes to mind to me is this chicken made with love. This chicken gives new meaning to all who thought they knew what rotisserie chicken is. I say, go to Cuenelli's and taste again for the very first time."}
{"user_id": "xjQSpme1Z7Xw8XehRLpYuA", "business_id": "EtKSTHV5Qx_Q7Aur9o4kQQ", "stars": 4.0, "text": "fuck yes. meat, bourbon libations, and a salad (to round things out aka make myself feel better about ingesting the aforementioned two items.) i took myself on an early birthday date with myself and was not disappointed (neither in the food nor the company). i had a medium rare plain burger to see if it was worth all the fuss...no cheese, bacon, dressing, etc to disguise the quality of the meat. (of course, no bread either since i'm gluten free.) the burger was great - perfectly cooked and seasoned... though, i felt like a bit of a freak sitting at the bar eating my burger with a knife and a fork. i'd like to come back to try a fancypants burger since the extras look pretty tasty.  the salad was so-so; it was no frills with the perfect amount of dressing. the bartender-cum-waiter was super attentive but not cloyingly so. he made delicious sazeracs to accompany my repast."}
{"user_id": "RycuS3TlPJKYCN6jaqgc7w", "business_id": "kTLHh3e_59XZduNwydxuAw", "stars": 1.0, "text": "Here's an update for my further Comcast experience. Our bill was increased to 250.00 a month. We called and removed some luxery items which brought our bill to 225.00 a month. Called 4 time a to see how we could get our bill lowered, as we have been a loyal customer for 14 years. \"Nothing we can do\" was all I heard. We decided to no longer be raped by this company and set up service with Verizon. Called Comcast to cancel once we got hooked up with Verizon. All of a sudden, they can do better and reduce my bill to 140.00 a month....which I would have been extremely happy with. Unfortunately, it should have been offered the four previous times I called.  I have Verizon now and have been quite happy with the installation, customer service, and overall product.  I wish Comcast would go under because they don't care about quality customer service. They could offer me a years free of service, yet I wouldn't take it on principle. Screw you Comcast!"}
{"user_id": "ZDUCfIgyPVG7HhFDWhK7kQ", "business_id": "EneM1oBFxncaR1nQCD3gYA", "stars": 5.0, "text": "This place is nothing short of astounding.  I went in for my first Brazilian and decided to get a blow-out as well.  These women are incredible in every way, from their work to their personalities. I've never felt more comfortable and relaxed under such intimidating circumstances (THANKS JENNE!).  Oh, and they're both comedians, so be ready to laugh the whole time you're here :)  Can not wait to go back!"}
{"user_id": "au30JemWvCjjTp5vWdOLow", "business_id": "Gw7UW0E2BguzL9suQnwDeg", "stars": 5.0, "text": "One of the best burgers in Philly!\n\nLow key joint with just a few tables and the kitchen in the dining room. But, don't let the modest face fool you, this place rocks!\n\nMenu is creative and fully customizable. Burgers are cooked on a flattop, perfectly seared, juicy, slightly charred. Fries are hand cut, fried fresh, perfectly crispy and salty. What more could you ask for from a burger place? \n\nPro tip - Download the SPOT app for a rewards program and some good coupons (aka free fries!)."}
{"user_id": "NyUuEF18_9trHBZpR9H4PA", "business_id": "I8eSWVzc_y9ORuKWgl07Tw", "stars": 5.0, "text": "Came there again because of yelp reviews!\nJust want to tell you the way the salon looks like already giving you feeling that they know what are they doing! Very clean, simple, professional. Two ladies met me at the front room, ask me about my preferences, tell me about the packages and prices they have - very understandable.  They put some information about me in the computer and i am all set for waxing!  They goes by appointments - always!! \nI did my armpits - to give it a try) My specialist were Despina!  Really really nice lady i've been pleased talking to her while she was easy with no pain taking off the hair which were really hard cause for 3-4 month i used shaving and the hair got really thick! Still it wasn't so painful cause she used the hard wax which i Loved immediately! Great job - very clean - fast and easy! And price was just 16$ which were really good deal for this quality of waxing! \nShe asked me when i would like to come back for armpits an we scheduled apointment in 3 weeks! But I might go earlier for bikini! I believe it wouldn't be so painful like it was before! So i will go for it! \nAs well i bought there a treat for ingrown hair!  We will see how it works)\nThank you Very much for great service! And great atmosphere! You can trust them!\n***** little addition********\nDid a bikini today!  Never was painless than today! ! Next time I will do full bikini! \nAgain thank you Despina!"}
{"user_id": "mGUYWSFpmVvDQTLDvkzk4w", "business_id": "Ir4-CFGZDfloJkUMax13Og", "stars": 3.0, "text": "They have a couple of really nice ladies, that go out of their way to help you. But there's one that will rip your head off if you're not careful. It won't take ya long to figure this out on your own though.  Jus' sayin'......"}